# Nurbs Surface Data Get Number Of Knots U Method

Source: https://www.revitapidocs.com/2026/47950b94-07db-01ba-1482-115bb34bd4f1.htm

---

| Nurbs Surface Data Get Number Of Knots U Method |
| --- |

Get the number of knots in the u\-direction.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public int GetNumberOfKnotsU()
```

```
Public Function GetNumberOfKnotsU As Integer
```

```
public:
int GetNumberOfKnotsU()
```

```
member GetNumberOfKnotsU : unit -> int
```

#### Return Value

Int32 See Also

#### Reference

NurbsSurfaceData Class Autodesk.Revit.DB Namespace